{
    "upgrade locations": {
		"leg upgrade": "About halfway though Chill Penguin's stage you'll see the upgrade capsule right in front of you. Unless you use a password, you cannot avoid getting this upgrade.",
		"helmet upgrade": "In storm eagle's stage, After the rising/falling platforms you'll come to a tall, skinny wall (it looks like a metal mesh) that you must climb to proceed. If you fall down on the right side of the wall (instead of jumping to the next platform at the top of the wall) you will fall into a small area with a ledge that you need to dash jump to get to. Once on the ledge you will see several flammable containers in the wall; shoot these with any weapon until they explode and walk into the small room to find the upgrade capsule.",
		"chest upgrade": "Near the start of sting chameleon's stage, you will come to a pit that you can enter below you to get a Heart Tank or you can jump the pit to enter what looks to be a cave (the ceiling and floor look much rockier). Instead, climb the wall on the right and proceed ABOVE the cave and you'll come to a small area that will soon be closed off by falling rocks. You have to fight a mini boss (shoot it in the eye to cause damage, Boomerang Cutter works best) to get the upgrade capsule.",
		"arm upgrade": "Near the beginning of Flame Mammoth's level, the stage will force you to go down to continue, followed by a large area with lava on the floor and platforms that the lava will break through (note: the lava will be frozen and can be walked on if Chill Penguin's stage has been cleared). Just before the first platform, breakable blocks can be seen near the ceiling. Dash jump to the blocks and use the helmet and leg upgrades to break them and climb up the wall. The upgrade capsule is in a small room at the top of the wall if you didn't already receive the upgrade in Sigma Stage 1. In Sigma Stage 1, defeat Vile and Zero will give you the upgrade if you didn't already get it in Flame Mammoth's stage. The special thing about this upgrade is that not only do you gain a third charge level for the Mega Buster, but you can also charge up your other weapons and unleash various abilities. For example, Chameleon Sting's charged attack turns Mega Man invincible for several seconds.",
		"hadouken": "As a reference to the Capcom series Street Fighter, a hidden upgrade capsule housing the Hadouken Fireball upgrade was placed into the game, complete with X actually yelling Hadouken! in a high pitch voice. It is not known why X does not yell Hadouken in Mega Man X Collection. You can access it in Armored Armadillo's stage after collecting all 4 armor upgrades, all 8 Heart Tanks, and all 4 Sub Tanks note that you don't have to fill the Sub Tanks. Before you make your way to the end of the level, farm extra lives at the start of the stage by killing the Bubble Bat repeatedly. Make sure your lives counter is 6 or more more if you're prone to dying while trying to reach the end of the stage."
	},
	"heart locations": {
		"chill penguin's stage": "After beating Flame Mammoth, get to the part with the Ride Armor get in it and ride it to the part where there's a cave you have to go through. At the left entrance you can jump straight up off of the column and then jump out of the Armor and up onto the ledge. Use Fire Wave to destroy the first mosquito bot generator up there and you'll see the Heart Tank laying inside.",
		"spark mandril's stage": "After killing the first Mega Tortoise, but before heading down the ladder, climb up the wall and you'll see a Heart Tank sitting there. You'll need to have the Leg Upgrade to get it, so hopefully you've been following this guide! Simply perform a wall dash while you're scaling the wall, then quickly jump on the ledge with the heart tank on it. Climb up and collect your prize. Alternately, you can use Boomerang Cutter instead.",
		"armored armadillo's stage": "Right after the second mine cart, you'll come to a large gap. Drop down and start shooting the Mole Borer with Flame Wave until it's finally destroyed, then continue down the path, where you'll see a Heart Tank on a ledge. Jump up on the ledge and take it, dropping back down and continuing down the path. If you haven't gotten Flame Wave, stay far right at the dropping part, then you'll land on the small platform. Carefully slide down the wall and drop in front of the Mole Borer. Run/dash ahead of the Mole Borer to the heart tank. Alternatively, if you are fast enough, you can use the X-Buster to shoot the Mole Borer before it reaches the heart container.",
		"launch octopus's stage": "After the second Angler Fish Robot, proceed forwards and you'll notice two large funnels. Jump into the second one, and when you get to the top, jump onto the green ship that's on the surface. Destroy the blue orb that's on the ship until it finally goes down (some annoying grabber bots will make your life harder, so destroy them if they get near you). The Storm Tornado can destroy blue orb immediately. The ship will then create a passage to an underground area: go in and prepare to fight the third sub-boss, a large snake robot. His only weakspots are his head and tail, so aim for those. He's very easy to dodge, but hits very hard, so try your best to avoid him. To easily dispatch him, use a Storm Tornado, charged or otherwise, and he'll be gone in no time. Once he's dead, go to the right, grab the Heart Tank, and then scale the wall next to the destroyed ship to make it back to the ocean floor. Note: The snake's body segments do not do any damage, so it is possible to stand on him while he's moving.",
		"boomer kuwanger's stage": "The Heart Tank is in plain sight, on a small balcony at the very top of the outside section of the stage. Go into the building, charge up the Shotgun Ice, and release it to create an ice platform. Jump on the platform, and it should go flying out of the building. Jump off the platform onto the balcony to obtain another Heart Tank. Alternatively, if you missed the Heart Tank through the first time, you can get it even easier. Equip the Boomerang Cutter, stand in the position shown in the picture, and shoot one boomerang. It will grab the heart tank and bring it to you... easy as that! Additionally it is even possible to dash jump off the wall below the balcony and make it up to the Heart Tank. It is similar to the jump to Spark Mandrill's Heart Tank, only much, much harder. It is known to the speedrunning community as the legendary 'iceless' jump.",
		"sting chameleon's stage": "Before going down into the tunnel, jump into the pit right before it (sounds scary but don't worry) and destroy the blocks with your Leg Upgrade. Stand at the edge of the small platform and perform a dash jump, which will cause you to land on the platform that's on the other side; pick up the Heart Tank and go back the same way you came. Make sure to have beaten Launch Octopus's stage, or else there won't be any water in the pit.",
		"storm eagle's stage": "When you get to the very top of the moving platforms in the beginning, dash jump to the left from the moving platform you're currently on; if you jump far enough, you should land on a roof where a Heart Tank lies. To continue with the stage, jump down and go on the moving platforms again, but this time, jump to the right instead of the left once you reach the top.",
		"flame mammoth's stage": "After beating Chill Penguin, follow the level until you run into the pick axe throwers. From there, run across the ice covered floor to the very bottom right. The Heart Tank lies in the corner. If you defeated Boomer Kuwanger, the Boomerang Cutter is also a neat way to get it. It is technically possible to obtain the Heart Tank before defeating Chill Penguin or Boomer Kuwanger, although it will result in death on the lava if not enough Heart Tanks or the Armor Upgrade have been found."
	},
	"subtanks": {
		"spark mandril's stage": "Proceed right from the start of the stage, using ladders to stay on the bottom level whenever possible. When you get to a dead end on the bottom level you will see the Sub Tank behind the wall. Use the Boomerang Cutter to grab it and the weapon will bring it back to you through the wall.",
		"storm eagle": "After your initial climb at the beginning of the stage, you'll find a turret sitting on a small platform. Destroy the turret and step on the platform. It will raise you up to a higher platform with a large glass window. Shoot the glass to gain access, then walk to the right and destroy the enemy you find there to shatter the rest of the glass. The Sub Tank is behind the enemy on the right. Note that you can also gain access to this building from the right side, thereby dodging the enemy in the center.",
		"flame mammoth": "In the large area with many platforms and lava on the ground (the lava will be frozen if you've beaten Chill Penguin's stage) climb up to the top platform and make your way to the left to find a 1-Up. If you dash jump from there to the left you can wall jump up the wall to see the Sub Tank behind two columns of breakable bricks. Break the bricks with your leg upgrade by wall jumping against them and the Sub Tank is yours. You can make a short cut to the Sub Tank by creating a charged Shotgun Ice platform beneath the wall leading up to the Sub Tank, bypassing the platforms with the pickaxe-throwing enemies, and the Sub Tank can also be retrieved faster with a Boomerang Cutter thrown through the wall.",
		"sting chamaleon": "Near the start of the level you'll be required to slide down a wall and will soon be followed by a reploid swinging a spiked bar behind you. Scroll far enough down the screen to activate the reploid who will begin breaking through the wall. Wall jump back up to safety, then drop down behind it and move left into the cave to find the Sub Tank."
	}
}